000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MAINPROG.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 INPUT-NUMBER         PIC 9(4) VALUE 5.
000700 01 INPUT-NUMBER-B       PIC 9(4) VALUE 2.
000800 01 RESULT-NUMBER        PIC 9(4).
000900 
001000 PROCEDURE DIVISION.
001100     DISPLAY "Main Program Starting..."
001200     DISPLAY "Input Number: " INPUT-NUMBER
001300 
001400     CALL 'SUBPROG'
001500         USING BY CONTENT INPUT-NUMBER
001600               BY REFERENCE RESULT-NUMBER
001700 
001800     DISPLAY "Result from SUBPROG: " RESULT-NUMBER
001900     DISPLAY "Input Number: " INPUT-NUMBER-B
002000 
002100     CALL 'SUBPROG'
002200         USING BY CONTENT INPUT-NUMBER-B
002300               BY REFERENCE RESULT-NUMBER
002400 
002500     DISPLAY "Result from SUBPROG: " RESULT-NUMBER
002600 
002700     DISPLAY "STILL RUNNING!"
002800     DISPLAY "oKAY WE STILL HERE"
003000     STOP RUN.
