000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SUBPROG.
000300*
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 JSCODE           PIC X(76)
000700*Note that the size of the pic needs to be close to the size of the string
000800                     VALUE "console.log('This is supposed to be a long continued hello from javascript')".
000900*
001000 LINKAGE SECTION.
001100 01 L-INPUT-NUMBER   PIC 9(4).
001200 01 L-RESULT-NUMBER  PIC 9(4).
001300*
001400*
001500 PROCEDURE DIVISION USING L-INPUT-NUMBER L-RESULT-NUMBER.
001600     CALL 'emscripten_run_script' USING BY CONTENT JSCODE.
001700     MULTIPLY L-INPUT-NUMBER BY 2 GIVING L-RESULT-NUMBER.
001800     EXIT PROGRAM.
