000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SUBPROG.
000300*
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 JSCODE           PIC X(73)
000700*Note that the size of the pic needs to be close to the size of the string
000800                     VALUE "console.log('This is supposed to be a 
000900-"long split hello from javascript')".
001000*
001100 LINKAGE SECTION.
001200 01 L-INPUT-NUMBER   PIC 9(4).
001300 01 L-RESULT-NUMBER  PIC 9(4).
001400*
001500*
001600 PROCEDURE DIVISION USING L-INPUT-NUMBER L-RESULT-NUMBER.
001700     CALL 'emscripten_run_script' USING BY CONTENT JSCODE.
001800     MULTIPLY L-INPUT-NUMBER BY 2 GIVING L-RESULT-NUMBER.
001900     EXIT PROGRAM.
