000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SUBPROG.
000300 
000400 DATA DIVISION.
000500 LINKAGE SECTION.
000600 01 L-INPUT-NUMBER       PIC 9(4).
000700 01 L-RESULT-NUMBER      PIC 9(4).
000800 
000900 PROCEDURE DIVISION USING L-INPUT-NUMBER L-RESULT-NUMBER.
001000     MULTIPLY L-INPUT-NUMBER BY 2 GIVING L-RESULT-NUMBER
001100     EXIT PROGRAM.
